КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СертификатыЭлектроннойПодписи/КонтурЛогистика_СертификатыЭлектроннойПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_СертификатыЭлектроннойПодписи</name>
  <attributes>
    <name>ОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСертификата</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиТипаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладельцаСертификата</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатВыдан</name>
    <comment>Кому выдан сертификат: ЮЛ, ФЛ, ИП</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыПодписи/КонтурЛогистика_ТипыПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПодписи</name>
  <enumValues>
    <name>УКЭП</name>
  </enumValues>
  <enumValues>
    <name>ПЭП</name>
  </enumValues>
  <enumValues>
    <name>УНЭП</name>
  </enumValues>
  <enumValues>
    <name>Тестовая</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СертификатыЭлектроннойПодписи/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновитьТипПодписиЧерезДиадок() Экспорт
	
	Если ТипПодписи = Перечисления.КонтурЛогистика_ТипыПодписи.Тестовая Тогда
		Возврат;	
	КонецЕсли;
	
	ДвоичныеДанныеСертификата = ДанныеСертификата.Получить();
		
	Если ЗначениеЗаполнено(ДвоичныеДанныеСертификата) Тогда
		
		НашаОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация();
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеСертификата) И ЗначениеЗаполнено(НашаОрганизация) И ЗначениеЗаполнено(НашаОрганизация.ID) Тогда
			
			Результат = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ВыполнитьПроверкуСертификатаЧерезДиадок(НашаОрганизация.ID, ДвоичныеДанныеСертификата);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
			Записать();			
			
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли
